app/controllers/characters_controller.rb

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_character
      @character = Character.find(params[:id])